# Taps
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "nrlquaker/createzap"

# Fonts
brew "font-fira-code-nerd-font"
brew "font-fira-mono-nerd-font"
brew "font-blex-mono-nerd-font"

# Brews
brew "bat"
brew "direnv"
brew "eza"
brew "fd"
brew "fzf"
brew "gawk"
brew "gh"
brew "git"
brew "git-delta"
brew "gnupg"
brew "gtop"
brew "httpie"
brew "jq"
brew "lazygit"
brew "mas"
brew "neovim"
brew "pinentry-mac"
brew "poetry"
brew "pyenv"
brew "rcm"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tpm"
brew "tree"
brew "wget"
brew "zoxide"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

# Casks
cask "alacritty"
cask "amethyst"
cask "arc"
cask "karabiner-elements"
cask "obsidian"
cask "signal"
cask "spotify"

# Mac App Store apps
mas "Slack", id: 803453959
mas "Things 3", id: 904280696

